
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * azurerm_servicebus_subscription_rule.topic_filter_rule_civil
  * module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "app_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "civil-aat-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-aat-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # azurerm_servicebus_subscription_rule.topic_filter_rule_civil will be destroyed
  # (because azurerm_servicebus_subscription_rule.topic_filter_rule_civil is not in configuration)
  - resource "azurerm_servicebus_subscription_rule" "topic_filter_rule_civil" {
      - filter_type     = "CorrelationFilter" -> null
      - id              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat/subscriptions/hmc-to-civil-subscription-aat/rules/hmc-servicebus-aat-subscription-rule-civil" -> null
      - name            = "hmc-servicebus-aat-subscription-rule-civil" -> null
      - subscription_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat/subscriptions/hmc-to-civil-subscription-aat" -> null

      - correlation_filter {
          - properties = {
              - "hmctsServiceId" = "AAA7"
            } -> null
        }
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat|civil-aat"
        name                       = "civil-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription will be destroyed
  # (because azurerm_servicebus_subscription.servicebus_subscription is not in configuration)
  - resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      - auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S" -> null
      - client_scoped_subscription_enabled        = false -> null
      - dead_lettering_on_filter_evaluation_error = true -> null
      - dead_lettering_on_message_expiration      = true -> null
      - default_message_ttl                       = "P10675199DT2H48M5.4775807S" -> null
      - enable_batched_operations                 = false -> null
      - id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat/subscriptions/hmc-to-civil-subscription-aat" -> null
      - lock_duration                             = "PT1M" -> null
      - max_delivery_count                        = 10 -> null
      - name                                      = "hmc-to-civil-subscription-aat" -> null
      - requires_session                          = false -> null
      - status                                    = "Active" -> null
      - topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat" -> null
    }

Plan: 0 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2774,"Program":"tfcmt","SHA1":"","Vars":{}} -->